analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32690/Include/adc_regs.h
#define MXC_F_ADC_CTRL1_TS_SEL_POS                     7 /**< CTRL1_TS_SEL Position */
#define MXC_F_ADC_CTRL1_TS_SEL                         ((uint32_t)(0x1UL << MXC_F_ADC_CTRL1_TS_SEL_POS)) /**< CTRL1_TS_SEL Mask */

#define MXC_F_ADC_CTRL1_AVG_POS                        8 /**< CTRL1_AVG Position */
#define MXC_F_ADC_CTRL1_AVG                            ((uint32_t)(0x7UL << MXC_F_ADC_CTRL1_AVG_POS)) /**< CTRL1_AVG Mask */
#define MXC_V_ADC_CTRL1_AVG_AVG1                       ((uint32_t)0x0UL) /**< CTRL1_AVG_AVG1 Value */
#define MXC_S_ADC_CTRL1_AVG_AVG1                       (MXC_V_ADC_CTRL1_AVG_AVG1 << MXC_F_ADC_CTRL1_AVG_POS) /**< CTRL1_AVG_AVG1 Setting */
#define MXC_V_ADC_CTRL1_AVG_AVG2                       ((uint32_t)0x1UL) /**< CTRL1_AVG_AVG2 Value */
#define MXC_S_ADC_CTRL1_AVG_AVG2                       (MXC_V_ADC_CTRL1_AVG_AVG2 << MXC_F_ADC_CTRL1_AVG_POS) /**< CTRL1_AVG_AVG2 Setting */
#define MXC_V_ADC_CTRL1_AVG_AVG4                       ((uint32_t)0x2UL) /**< CTRL1_AVG_AVG4 Value */
#define MXC_S_ADC_CTRL1_AVG_AVG4                       (MXC_V_ADC_CTRL1_AVG_AVG4 << MXC_F_ADC_CTRL1_AVG_POS) /**< CTRL1_AVG_AVG4 Setting */
#define MXC_V_ADC_CTRL1_AVG_AVG8                       ((uint32_t)0x3UL) /**< CTRL1_AVG_AVG8 Value */
#define MXC_S_ADC_CTRL1_AVG_AVG8                       (MXC_V_ADC_CTRL1_AVG_AVG8 << MXC_F_ADC_CTRL1_AVG_POS) /**< CTRL1_AVG_AVG8 Setting */
#define MXC_V_ADC_CTRL1_AVG_AVG16                      ((uint32_t)0x4UL) /**< CTRL1_AVG_AVG16 Value */
#define MXC_S_ADC_CTRL1_AVG_AVG16                      (MXC_V_ADC_CTRL1_AVG_AVG16 << MXC_F_ADC_CTRL1_AVG_POS) /**< CTRL1_AVG_AVG16 Setting */
#define MXC_V_ADC_CTRL1_AVG_AVG32                      ((uint32_t)0x5UL) /**< CTRL1_AVG_AVG32 Value */
#define MXC_S_ADC_CTRL1_AVG_AVG32                      (MXC_V_ADC_CTRL1_AVG_AVG32 << MXC_F_ADC_CTRL1_AVG_POS) /**< CTRL1_AVG_AVG32 Setting */

#define MXC_F_ADC_CTRL1_NUM_SLOTS_POS                  16 /**< CTRL1_NUM_SLOTS Position */
#define MXC_F_ADC_CTRL1_NUM_SLOTS                      ((uint32_t)(0x1FUL << MXC_F_ADC_CTRL1_NUM_SLOTS_POS)) /**< CTRL1_NUM_SLOTS Mask */

/**@} end of group ADC_CTRL1_Register */

/**
 * @ingroup  adc_registers
 * @defgroup ADC_CLKCTRL ADC_CLKCTRL
 * @brief    Clock Control Register.
 * @{
 */
#define MXC_F_ADC_CLKCTRL_CLKSEL_POS                   0 /**< CLKCTRL_CLKSEL Position */
#define MXC_F_ADC_CLKCTRL_CLKSEL                       ((uint32_t)(0x3UL << MXC_F_ADC_CLKCTRL_CLKSEL_POS)) /**< CLKCTRL_CLKSEL Mask */
#define MXC_V_ADC_CLKCTRL_CLKSEL_HCLK                  ((uint32_t)0x0UL) /**< CLKCTRL_CLKSEL_HCLK Value */
#define MXC_S_ADC_CLKCTRL_CLKSEL_HCLK                  (MXC_V_ADC_CLKCTRL_CLKSEL_HCLK << MXC_F_ADC_CLKCTRL_CLKSEL_POS) /**< CLKCTRL_CLKSEL_HCLK Setting */
#define MXC_V_ADC_CLKCTRL_CLKSEL_CLK_ADC0              ((uint32_t)0x1UL) /**< CLKCTRL_CLKSEL_CLK_ADC0 Value */
#define MXC_S_ADC_CLKCTRL_CLKSEL_CLK_ADC0              (MXC_V_ADC_CLKCTRL_CLKSEL_CLK_ADC0 << MXC_F_ADC_CLKCTRL_CLKSEL_POS) /**< CLKCTRL_CLKSEL_CLK_ADC0 Setting */
#define MXC_V_ADC_CLKCTRL_CLKSEL_CLK_ADC1              ((uint32_t)0x2UL) /**< CLKCTRL_CLKSEL_CLK_ADC1 Value */
#define MXC_S_ADC_CLKCTRL_CLKSEL_CLK_ADC1              (MXC_V_ADC_CLKCTRL_CLKSEL_CLK_ADC1 << MXC_F_ADC_CLKCTRL_CLKSEL_POS) /**< CLKCTRL_CLKSEL_CLK_ADC1 Setting */
#define MXC_V_ADC_CLKCTRL_CLKSEL_CLK_ADC2              ((uint32_t)0x3UL) /**< CLKCTRL_CLKSEL_CLK_ADC2 Value */
#define MXC_S_ADC_CLKCTRL_CLKSEL_CLK_ADC2              (MXC_V_ADC_CLKCTRL_CLKSEL_CLK_ADC2 << MXC_F_ADC_CLKCTRL_CLKSEL_POS) /**< CLKCTRL_CLKSEL_CLK_ADC2 Setting */

#define MXC_F_ADC_CLKCTRL_CLKDIV_POS                   4 /**< CLKCTRL_CLKDIV Position */
#define MXC_F_ADC_CLKCTRL_CLKDIV                       ((uint32_t)(0x7UL << MXC_F_ADC_CLKCTRL_CLKDIV_POS)) /**< CLKCTRL_CLKDIV Mask */
#define MXC_V_ADC_CLKCTRL_CLKDIV_DIV2                  ((uint32_t)0x0UL) /**< CLKCTRL_CLKDIV_DIV2 Value */
#define MXC_S_ADC_CLKCTRL_CLKDIV_DIV2                  (MXC_V_ADC_CLKCTRL_CLKDIV_DIV2 << MXC_F_ADC_CLKCTRL_CLKDIV_POS) /**< CLKCTRL_CLKDIV_DIV2 Setting */
#define MXC_V_ADC_CLKCTRL_CLKDIV_DIV4                  ((uint32_t)0x1UL) /**< CLKCTRL_CLKDIV_DIV4 Value */
#define MXC_S_ADC_CLKCTRL_CLKDIV_DIV4                  (MXC_V_ADC_CLKCTRL_CLKDIV_DIV4 << MXC_F_ADC_CLKCTRL_CLKDIV_POS) /**< CLKCTRL_CLKDIV_DIV4 Setting */
#define MXC_V_ADC_CLKCTRL_CLKDIV_DIV8                  ((uint32_t)0x2UL) /**< CLKCTRL_CLKDIV_DIV8 Value */
#define MXC_S_ADC_CLKCTRL_CLKDIV_DIV8                  (MXC_V_ADC_CLKCTRL_CLKDIV_DIV8 << MXC_F_ADC_CLKCTRL_CLKDIV_POS) /**< CLKCTRL_CLKDIV_DIV8 Setting */
#define MXC_V_ADC_CLKCTRL_CLKDIV_DIV16                 ((uint32_t)0x3UL) /**< CLKCTRL_CLKDIV_DIV16 Value */
#define MXC_S_ADC_CLKCTRL_CLKDIV_DIV16                 (MXC_V_ADC_CLKCTRL_CLKDIV_DIV16 << MXC_F_ADC_CLKCTRL_CLKDIV_POS) /**< CLKCTRL_CLKDIV_DIV16 Setting */
#define MXC_V_ADC_CLKCTRL_CLKDIV_DIV1                  ((uint32_t)0x4UL) /**< CLKCTRL_CLKDIV_DIV1 Value */
#define MXC_S_ADC_CLKCTRL_CLKDIV_DIV1                  (MXC_V_ADC_CLKCTRL_CLKDIV_DIV1 << MXC_F_ADC_CLKCTRL_CLKDIV_POS) /**< CLKCTRL_CLKDIV_DIV1 Setting */

/**@} end of group ADC_CLKCTRL_Register */

/**
 * @ingroup  adc_registers
 * @defgroup ADC_SAMPCLKCTRL ADC_SAMPCLKCTRL
 * @brief    Sample Clock Control Register.
 * @{
 */
#define MXC_F_ADC_SAMPCLKCTRL_TRACK_CNT_POS            0 /**< SAMPCLKCTRL_TRACK_CNT Position */
#define MXC_F_ADC_SAMPCLKCTRL_TRACK_CNT                ((uint32_t)(0x3FFUL << MXC_F_ADC_SAMPCLKCTRL_TRACK_CNT_POS)) /**< SAMPCLKCTRL_TRACK_CNT Mask */

#define MXC_F_ADC_SAMPCLKCTRL_IDLE_CNT_POS             16 /**< SAMPCLKCTRL_IDLE_CNT Position */
#define MXC_F_ADC_SAMPCLKCTRL_IDLE_CNT                 ((uint32_t)(0xFFFFUL << MXC_F_ADC_SAMPCLKCTRL_IDLE_CNT_POS)) /**< SAMPCLKCTRL_IDLE_CNT Mask */

/**@} end of group ADC_SAMPCLKCTRL_Register */

/**
 * @ingroup  adc_registers
 * @defgroup ADC_CHSEL0 ADC_CHSEL0
 * @brief    Channel Select Register 0.
 * @{
 */
#define MXC_F_ADC_CHSEL0_SLOT0_ID_POS                  0 /**< CHSEL0_SLOT0_ID Position */
#define MXC_F_ADC_CHSEL0_SLOT0_ID                      ((uint32_t)(0x1FUL << MXC_F_ADC_CHSEL0_SLOT0_ID_POS)) /**< CHSEL0_SLOT0_ID Mask */

#define MXC_F_ADC_CHSEL0_SLOT1_ID_POS                  8 /**< CHSEL0_SLOT1_ID Position */
#define MXC_F_ADC_CHSEL0_SLOT1_ID                      ((uint32_t)(0x1FUL << MXC_F_ADC_CHSEL0_SLOT1_ID_POS)) /**< CHSEL0_SLOT1_ID Mask */

